ConfigFiles/InformationRegisters/ЗамещениеПользователейПоРаботеСОшибками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗамещениеПользователейПоРаботеСОшибками</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗамещающийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаЗамещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияЗамещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/InformationRegisters/ЗамещениеПользователейПоРаботеСОшибками/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Запись.ДатаНачалаЗамещения)
		И ЗначениеЗаполнено(Запись.ДатаОкончанияЗамещения)
		И Запись.ДатаНачалаЗамещения > Запись.ДатаОкончанияЗамещения Тогда
		
		ТекстСообщения = НСтр("ru='Неверно указаны даты замещения. Дата окончания не должна быть ранее даты начала'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Запись.ДатаОкончанияЗамещения",, Отказ);
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	// Проверка пересечений по периоду с существующими записями
	
	ДанныеОКонфликте = РегистрыСведений.ЗамещениеПользователейПоРаботеСОшибками.ДанныеКонфликтующейЗаписиОЗамещении(Запись,
		               Запись.ИсходныйКлючЗаписи);
					   
	Если ЗначениеЗаполнено(ДанныеОКонфликте.Пользователь) Тогда
		
		ТекстСообщения = НСтр("ru='Для указанного пользователя и проекта уже существует запись о замещении с %ДатаНачала% по %ДатаОкончания%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДатаНачала%", Формат(ДанныеоКонфликте.ДатаНачалаЗамещения, "ДФ=дд.ММ.гг"));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДатаОкончания%", Формат(ДанныеоКонфликте.ДатаОкончанияЗамещения, "ДФ=дд.ММ.гг"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСОобщения);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти
